In [1]:
#bibliotecas numpy e pandas
import numpy as np
import pandas as pd

In [2]:
#biblioteca com os dados da planilha
sheets = pd.read_excel('dados.xlsx', sheet_name=['orcado','realizado'])

In [3]:
#DataFrame que recebe os dados da planilha na aba orcado
orcado = sheets['orcado']

In [4]:
#Dataframe que recebe os dados da planilha da aba realizado e faz um transpose para manter a formatação do Dataframe orcado
realizado = sheets['realizado'].T

In [6]:
realizado #necessário redefinir o index

              NaN Realizado
Mes_1     janeiro       240
Mes_2   fevereiro       280
Mes_3       março       200
Mes_4       abril       310
Mes_5        maio       230
Mes_6       junho       213
Mes_7       julho       239
Mes_8      agosto       210
Mes_9    setembro       210
Mes_10    outubro       210
Mes_11   novembro       232
Mes_12   dezembro       213

In [7]:
#realiza o reset do index e salva a alteraçao
realizado.reset_index(inplace=True)

In [8]:
realizado

     index        NaN Realizado
0    Mes_1    janeiro       240
1    Mes_2  fevereiro       280
2    Mes_3      março       200
3    Mes_4      abril       310
4    Mes_5       maio       230
5    Mes_6      junho       213
6    Mes_7      julho       239
7    Mes_8     agosto       210
8    Mes_9   setembro       210
9   Mes_10    outubro       210
10  Mes_11   novembro       232
11  Mes_12   dezembro       213

In [9]:
#deleta a coluna index e salva a alteração
realizado.drop('index',axis=1, inplace=True)

In [10]:
realizado

          NaN Realizado
0     janeiro       240
1   fevereiro       280
2       março       200
3       abril       310
4        maio       230
5       junho       213
6       julho       239
7      agosto       210
8    setembro       210
9     outubro       210
10   novembro       232
11   dezembro       213

In [11]:
#insere o nome da coluna que está vazia 'nan' e salva a alteração
realizado.rename(columns={np.nan:'mês'}, inplace=True)

In [12]:
realizado

          mês Realizado
0     janeiro       240
1   fevereiro       280
2       março       200
3       abril       310
4        maio       230
5       junho       213
6       julho       239
7      agosto       210
8    setembro       210
9     outubro       210
10   novembro       232
11   dezembro       213

In [13]:
#DataFrame 'dados_saida' com o merge dos dois Dataframes já tratados 'orcado' e 'realizado'
dados_saida = pd.merge(orcado, realizado)

In [14]:
dados_saida

          mês  orcado Realizado
0     janeiro     330       240
1   fevereiro     290       280
2       março     230       200
3       abril     321       310
4        maio     283       230
5       junho     291       213
6       julho     193       239
7      agosto     259       210
8    setembro     289       210
9     outubro     230       210
10   novembro     434       232
11   dezembro     421       213

In [15]:
#insere uma nova coluna com a diferença entre o 'orcado' e 'realizado'
dados_saida.insert(3, column=3, value=orcado['orcado'] - realizado['Realizado'])

In [16]:
dados_saida

          mês  orcado Realizado    3
0     janeiro     330       240   90
1   fevereiro     290       280   10
2       março     230       200   30
3       abril     321       310   11
4        maio     283       230   53
5       junho     291       213   78
6       julho     193       239  -46
7      agosto     259       210   49
8    setembro     289       210   79
9     outubro     230       210   20
10   novembro     434       232  202
11   dezembro     421       213  208

In [17]:
#altera o nome da coluna 3 para 'diff' e salvando as alterações
dados_saida.rename(columns={3:'diff'}, inplace=True)

In [18]:
dados_saida

          mês  orcado Realizado diff
0     janeiro     330       240   90
1   fevereiro     290       280   10
2       março     230       200   30
3       abril     321       310   11
4        maio     283       230   53
5       junho     291       213   78
6       julho     193       239  -46
7      agosto     259       210   49
8    setembro     289       210   79
9     outubro     230       210   20
10   novembro     434       232  202
11   dezembro     421       213  208

In [20]:
#Exporta 'dados_saida' para extensão '.csv'
dados_saida.to_csv('dados_saida.csv',sep=';',index=False)